CircuitSetup/stm32h7_test_program/src/ap6256_cyw43_port.c
#include "ap6256_cyw43_port.h"

#include "ap6256_cyw43_compat.h"
#include "ap6256_driver.h"
#include "cyw43_configport.h"
#include "main.h"

#include "cmsis_os2.h"
#include "stm32h7xx_ll_sdmmc.h"

#include <stdbool.h>
#include <string.h>
#include <stdint.h>

#define AP6256_CYW43_SDIO_CMD_TIMEOUT_MS 120U
#define AP6256_CYW43_SDIO_READY_TIMEOUT_MS 500U
#define AP6256_CYW43_SDIO_CMD_GUARD_LOOPS 2000000UL
#define AP6256_CYW43_WL_REG_ON_PORT GPIOC
#define AP6256_CYW43_WL_REG_ON_PIN  GPIO_PIN_7
#define AP6256_CYW43_SDIO_DAT1_PORT GPIOC
#define AP6256_CYW43_SDIO_DAT1_PIN  GPIO_PIN_9
#define AP6256_CYW43_BREADCRUMB_MAGIC 0xA6256C43UL
#define AP6256_CYW43_PRE_RESET_MAGIC 0xA6256D43UL
#define AP6256_CYW43_PRE_RESET_THROTTLE_MS 25U

static osMutexId_t s_cyw43_mutex;
static volatile uint8_t s_poll_pending;
static uint8_t s_sdio_open;
extern void (*cyw43_poll)(void);
static volatile uint32_t s_cyw43_sched_calls;
static volatile uintptr_t s_cyw43_last_sched_func;
static volatile uint32_t s_cyw43_sdio_init_calls;
static volatile uint32_t s_cyw43_sdio_reinit_calls;
static volatile int32_t s_cyw43_last_bus_init_ret;
static volatile uint32_t s_cyw43_bus_stage;
static volatile int32_t s_cyw43_poll_header_read_status;
static volatile int32_t s_cyw43_poll_payload_read_status;
static volatile uint16_t s_cyw43_poll_hdr0;
static volatile uint16_t s_cyw43_poll_hdr1;
static volatile uint8_t s_cyw43_last_cmd53_write;
static volatile uint8_t s_cyw43_last_cmd53_function;
static volatile uint8_t s_cyw43_last_cmd53_block_mode;
static volatile uint32_t s_cyw43_last_cmd53_block_size;
static volatile uint32_t s_cyw43_last_cmd53_length;
static volatile int32_t s_cyw43_last_cmd53_status;
static volatile uint16_t s_cyw43_last_cmd53_frame_size;
static volatile uint32_t s_cyw43_last_cmd53_count;
static volatile uint32_t s_cyw43_last_cmd;
static volatile uint32_t s_cyw43_last_cmd_arg;
static volatile int32_t s_cyw43_last_cmd_status;
static volatile uint32_t s_cyw43_last_cmd_response;
static volatile uint32_t s_cyw43_chip_id_raw;
static volatile uint32_t s_cyw43_ram_base_addr;
static volatile uint32_t s_cyw43_ram_size_bytes;
static volatile uint32_t s_cyw43_boot_mode;
static volatile uint32_t s_cyw43_cpu_wrapper_addr;
static volatile uint32_t s_cyw43_ram_wrapper_addr;
static volatile uint32_t s_cyw43_firmware_addr;
static volatile uint32_t s_cyw43_nvram_addr;
static volatile uint32_t s_cyw43_footer_addr;
static volatile uint32_t s_cyw43_cpu_core_id;
static volatile uint32_t s_cyw43_ram_core_id;
static volatile uint32_t s_cyw43_reset_vector_addr;
static volatile uint32_t s_cyw43_reset_vector_value;
static volatile uint32_t s_cyw43_verify_mismatch_addr;
static volatile uint32_t s_cyw43_verify_expected;
static volatile uint32_t s_cyw43_verify_actual;
static volatile uint32_t s_cyw43_nvram_packed_len;
static volatile uint32_t s_cyw43_nvram_padded_len;
static volatile uint32_t s_cyw43_nvram_footer_word;
static volatile uint8_t s_cyw43_nvram_using_reference;
static volatile uint8_t s_cyw43_chip_clock_csr_diag;
static volatile uint32_t s_cyw43_sr_control1_diag;
static volatile uint32_t s_cyw43_wlan_ioctrl_diag;
static volatile uint32_t s_cyw43_wlan_resetctrl_diag;
static volatile uint32_t s_cyw43_socram_ioctrl_diag;
static volatile uint32_t s_cyw43_socram_resetctrl_diag;
static volatile uint8_t s_cyw43_wakeup_ctrl_diag;
static volatile uint8_t s_cyw43_sleep_csr_diag;
static volatile uint8_t s_cyw43_cardcap_diag;
static volatile uint8_t s_cyw43_io_ready_diag;
static volatile uint32_t s_cyw43_checkpoint;
static volatile uint32_t s_cyw43_checkpoint_result;
static volatile uint32_t s_cyw43_last_success_checkpoint;
static volatile uint8_t s_cyw43_checkpoint_function;
static volatile uint32_t s_cyw43_checkpoint_address;
static volatile uint32_t s_cyw43_checkpoint_write_value;
static volatile uint32_t s_cyw43_checkpoint_readback_value;
static volatile int32_t s_cyw43_checkpoint_status;
static volatile uint32_t s_cyw43_profile;
static volatile uint8_t s_cyw43_backplane_is_write;
static volatile uint32_t s_cyw43_backplane_address;
static volatile uint8_t s_cyw43_backplane_width_bytes;
static volatile int32_t s_cyw43_backplane_status;
static volatile uint8_t s_cyw43_reference_nvram_enabled;
static volatile uint32_t s_cyw43_last_async_event_type;
static volatile uint32_t s_cyw43_last_async_event_status;
static volatile uint32_t s_cyw43_last_async_event_reason;
static volatile uint32_t s_cyw43_last_async_event_flags;
static volatile uint32_t s_cyw43_async_event_count;
static volatile uint32_t s_cyw43_last_ioctl_kind;
static volatile uint32_t s_cyw43_last_ioctl_cmd;
static volatile uint32_t s_cyw43_last_ioctl_iface;
static volatile uint32_t s_cyw43_last_ioctl_len;
static volatile uint32_t s_cyw43_last_ioctl_id;
static volatile int32_t s_cyw43_last_ioctl_status;
static volatile int32_t s_cyw43_last_ioctl_poll;
static volatile uint32_t s_cyw43_last_ioctl_phase;
static volatile uint8_t s_cyw43_packet_pending;
static volatile uint8_t s_cyw43_packet_pending_source;
static volatile uint8_t s_cyw43_dat1_level;
static volatile uint8_t s_cyw43_cccr_int_pending;
static volatile uint32_t s_cyw43_f1_int_status;
static volatile int32_t s_cyw43_packet_pending_status;
static volatile int32_t s_cyw43_kso_status;
static volatile uint32_t s_cyw43_scan_wake_step;
static volatile uint8_t s_cyw43_send_flow_control;
static volatile uint8_t s_cyw43_send_tx_seq;
static volatile uint8_t s_cyw43_send_credit;
static volatile uint8_t s_cyw43_send_synthetic_credit;
static volatile int32_t s_cyw43_send_credit_status;
static volatile int32_t s_cyw43_setup_status;
static volatile uint32_t s_cyw43_breadcrumb_stage;
static volatile int32_t s_cyw43_breadcrumb_detail;
static volatile uint32_t s_cyw43_breadcrumb_tick_ms;
static volatile uint32_t s_cyw43_breadcrumb_reset_flags;
static volatile uint32_t s_cyw43_boot_reset_flags;
static volatile uint32_t s_cyw43_wait_no_packet_count;
static volatile uint32_t s_cyw43_wait_recovery_count;
static volatile uint32_t s_cyw43_wait_forced_probe_count;
static volatile uint32_t s_cyw43_wait_resend_count;
static volatile uint8_t s_cyw43_ioctl_recovery_attempted;
static volatile uint8_t s_cyw43_ioctl_forced_probe_attempted;
static volatile uint8_t s_cyw43_ioctl_resend_attempted;
static volatile uint32_t s_cyw43_last_pre_reset_persist_tick;

static void ap6256_cyw43_enable_backup_access(void)
{
    HAL_PWR_EnableBkUpAccess();
}

static void ap6256_cyw43_append_reset_flag(char *buffer, size_t buffer_len, const char *flag)
{
    size_t used;
    size_t remaining;

    if ((buffer == NULL) || (flag == NULL) || (buffer_len == 0U)) {
        return;
    }

