CircuitSetup/stm32h7_test_program/src/ap6256_cyw43_port.c
    used = strlen(buffer);
    if (used >= (buffer_len - 1U)) {
        return;
    }

    if (used != 0U) {
        buffer[used++] = '|';
        buffer[used] = '\0';
    }

    remaining = buffer_len - used - 1U;
    (void)strncpy(&buffer[used], flag, remaining);
    buffer[buffer_len - 1U] = '\0';
}

static uint8_t ap6256_cyw43_pre_reset_valid_raw(void)
{
    return (RTC->BKP8R == AP6256_CYW43_PRE_RESET_MAGIC) ? 1U : 0U;
}

static void ap6256_cyw43_port_persist_pre_reset_diag(uint8_t force)
{
    uint32_t now = HAL_GetTick();
    uint32_t iface_len;
    uint32_t packet_pack;
    uint32_t cmd53_pack;
    uint32_t send_pack;

    if ((force == 0U) &&
        ((now - s_cyw43_last_pre_reset_persist_tick) < AP6256_CYW43_PRE_RESET_THROTTLE_MS)) {
        return;
    }
    s_cyw43_last_pre_reset_persist_tick = now;

    iface_len = (s_cyw43_last_ioctl_iface & 0xFFU) |
                ((s_cyw43_last_ioctl_len & 0x00FFFFFFUL) << 8U);
    packet_pack = (s_cyw43_packet_pending & 0x01U) |
                  ((uint32_t)(s_cyw43_packet_pending_source & 0x07U) << 1U) |
                  ((uint32_t)s_cyw43_dat1_level << 8U) |
                  ((uint32_t)s_cyw43_cccr_int_pending << 16U);
    cmd53_pack = (s_cyw43_last_cmd53_write & 0x01U) |
                 ((uint32_t)(s_cyw43_last_cmd53_function & 0x07U) << 1U) |
                 ((uint32_t)(s_cyw43_last_cmd53_block_mode & 0x01U) << 4U) |
                 ((uint32_t)s_cyw43_last_cmd53_frame_size << 8U);
    send_pack = (uint32_t)s_cyw43_send_flow_control |
                ((uint32_t)s_cyw43_send_tx_seq << 8U) |
                ((uint32_t)s_cyw43_send_credit << 16U) |
                ((uint32_t)(s_cyw43_send_synthetic_credit & 0x01U) << 24U);

    ap6256_cyw43_enable_backup_access();
    RTC->BKP8R = AP6256_CYW43_PRE_RESET_MAGIC;
    RTC->BKP9R = s_cyw43_breadcrumb_stage;
    RTC->BKP10R = (uint32_t)s_cyw43_breadcrumb_detail;
    RTC->BKP11R = s_cyw43_breadcrumb_tick_ms;
    RTC->BKP12R = s_cyw43_last_ioctl_phase;
    RTC->BKP13R = s_cyw43_last_ioctl_kind;
    RTC->BKP14R = s_cyw43_last_ioctl_cmd;
    RTC->BKP15R = iface_len;
    RTC->BKP16R = s_cyw43_last_ioctl_id;
    RTC->BKP17R = (uint32_t)s_cyw43_last_ioctl_status;
    RTC->BKP18R = (uint32_t)s_cyw43_last_ioctl_poll;
    RTC->BKP19R = packet_pack;
    RTC->BKP20R = (uint32_t)s_cyw43_packet_pending_status;
    RTC->BKP21R = s_cyw43_f1_int_status;
    RTC->BKP22R = (uint32_t)s_cyw43_kso_status;
    RTC->BKP23R = s_cyw43_last_cmd;
    RTC->BKP24R = s_cyw43_last_cmd_arg;
    RTC->BKP25R = (uint32_t)s_cyw43_last_cmd_status;
    RTC->BKP26R = s_cyw43_last_cmd_response;
    RTC->BKP27R = cmd53_pack;
    RTC->BKP28R = s_cyw43_last_cmd53_block_size;
    RTC->BKP29R = s_cyw43_last_cmd53_length;
    RTC->BKP30R = (uint32_t)s_cyw43_last_cmd53_status;
    RTC->BKP31R = send_pack;
}

static void ap6256_cyw43_port_read_pre_reset_diag(ap6256_cyw43_pre_reset_diag_t *diag)
{
    uint32_t iface_len;
    uint32_t packet_pack;
    uint32_t cmd53_pack;
    uint32_t send_pack;

    if (diag == NULL) {
        return;
    }

    memset(diag, 0, sizeof(*diag));
    if (ap6256_cyw43_pre_reset_valid_raw() == 0U) {
        return;
    }

    diag->valid = 1U;
    diag->breadcrumb_stage = RTC->BKP9R;
    diag->breadcrumb_detail = (int32_t)RTC->BKP10R;
    diag->tick_ms = RTC->BKP11R;
    diag->ioctl_phase = RTC->BKP12R;
    diag->ioctl_kind = RTC->BKP13R;
    diag->ioctl_cmd = RTC->BKP14R;
    iface_len = RTC->BKP15R;
    diag->ioctl_iface = iface_len & 0xFFU;
    diag->ioctl_len = (iface_len >> 8U) & 0x00FFFFFFUL;
    diag->ioctl_id = RTC->BKP16R;
    diag->ioctl_status = (int32_t)RTC->BKP17R;
    diag->ioctl_poll = (int32_t)RTC->BKP18R;
    packet_pack = RTC->BKP19R;
    diag->packet_pending = packet_pack & 0x01U;
    diag->packet_pending_source = (packet_pack >> 1U) & 0x07U;
    diag->dat1_level = (packet_pack >> 8U) & 0xFFU;
    diag->cccr_int_pending = (packet_pack >> 16U) & 0xFFU;
    diag->packet_pending_status = (int32_t)RTC->BKP20R;
    diag->f1_int_status = RTC->BKP21R;
    diag->kso_status = (int32_t)RTC->BKP22R;
    diag->last_cmd = RTC->BKP23R;
    diag->last_cmd_arg = RTC->BKP24R;
    diag->last_cmd_status = (int32_t)RTC->BKP25R;
    diag->last_cmd_response = RTC->BKP26R;
    cmd53_pack = RTC->BKP27R;
    diag->cmd53_write = cmd53_pack & 0x01U;
    diag->cmd53_function = (cmd53_pack >> 1U) & 0x07U;
    diag->cmd53_block_mode = (cmd53_pack >> 4U) & 0x01U;
    diag->cmd53_frame_size = (uint16_t)((cmd53_pack >> 8U) & 0xFFFFU);
    diag->cmd53_block_size = RTC->BKP28R;
    diag->cmd53_length = RTC->BKP29R;
    diag->cmd53_status = (int32_t)RTC->BKP30R;
    send_pack = RTC->BKP31R;
    diag->send_flow_control = send_pack & 0xFFU;
    diag->send_tx_seq = (send_pack >> 8U) & 0xFFU;
    diag->send_credit = (send_pack >> 16U) & 0xFFU;
    diag->send_synthetic_credit = (send_pack >> 24U) & 0x01U;
}

void ap6256_cyw43_port_record_breadcrumb(uint32_t stage, int32_t detail)
{
    uint32_t tick_ms = HAL_GetTick();
    uint32_t reset_flags = RCC->RSR;

    s_cyw43_breadcrumb_stage = stage;
    s_cyw43_breadcrumb_detail = detail;
    s_cyw43_breadcrumb_tick_ms = tick_ms;
    s_cyw43_breadcrumb_reset_flags = reset_flags;

    ap6256_cyw43_enable_backup_access();
    RTC->BKP1R = AP6256_CYW43_BREADCRUMB_MAGIC;
    RTC->BKP2R = stage;
    RTC->BKP3R = (uint32_t)detail;
    RTC->BKP4R = tick_ms;
    RTC->BKP5R = reset_flags;
    ap6256_cyw43_port_persist_pre_reset_diag(1U);
}

void ap6256_cyw43_port_capture_boot_reset_flags(uint32_t flags)
{
    s_cyw43_boot_reset_flags = flags;
}

uint8_t ap6256_cyw43_port_breadcrumb_valid(void)
{
    return (RTC->BKP1R == AP6256_CYW43_BREADCRUMB_MAGIC) ? 1U : 0U;
}

uint32_t ap6256_cyw43_port_breadcrumb_stage(void)
{
    return (ap6256_cyw43_port_breadcrumb_valid() != 0U) ? RTC->BKP2R : s_cyw43_breadcrumb_stage;
}

int32_t ap6256_cyw43_port_breadcrumb_detail(void)
{
    return (ap6256_cyw43_port_breadcrumb_valid() != 0U) ? (int32_t)RTC->BKP3R : s_cyw43_breadcrumb_detail;
}

uint32_t ap6256_cyw43_port_breadcrumb_tick_ms(void)
{
    return (ap6256_cyw43_port_breadcrumb_valid() != 0U) ? RTC->BKP4R : s_cyw43_breadcrumb_tick_ms;
}

uint32_t ap6256_cyw43_port_breadcrumb_reset_flags(void)
{
    return (ap6256_cyw43_port_breadcrumb_valid() != 0U) ? RTC->BKP5R : s_cyw43_breadcrumb_reset_flags;
}

uint32_t ap6256_cyw43_port_boot_reset_flags(void)
{
    return s_cyw43_boot_reset_flags;
}

const char *ap6256_cyw43_port_breadcrumb_name(uint32_t stage)
{
    switch (stage) {
    case AP6256_CYW43_BREADCRUMB_NONE:
        return "none";
    case AP6256_CYW43_BREADCRUMB_SETUP_ENTER:
        return "setup_enter";
    case AP6256_CYW43_BREADCRUMB_WIFI_ON:
        return "wifi_on";
    case AP6256_CYW43_BREADCRUMB_BUS_INIT:
        return "bus_init";
    case AP6256_CYW43_BREADCRUMB_LL_WIFI_ON:
        return "ll_wifi_on";
    case AP6256_CYW43_BREADCRUMB_PM:
        return "pm";
    case AP6256_CYW43_BREADCRUMB_TCPIP_INIT:
        return "tcpip_init";
    case AP6256_CYW43_BREADCRUMB_SETUP_EXIT:
        return "setup_exit";
    case AP6256_CYW43_BREADCRUMB_SCAN_START:
        return "scan_start";
    case AP6256_CYW43_BREADCRUMB_SCAN_ACCEPTED:
        return "scan_accepted";
    case AP6256_CYW43_BREADCRUMB_SCAN_WAIT:
        return "scan_wait";
    case AP6256_CYW43_BREADCRUMB_SCAN_COMPLETE:
        return "scan_complete";
    case AP6256_CYW43_BREADCRUMB_PROMPT_SSID:
        return "prompt_ssid";
    case AP6256_CYW43_BREADCRUMB_SCAN_TIMEOUT:
        return "scan_timeout";
    case AP6256_CYW43_BREADCRUMB_RELEASE:
        return "release";
    case AP6256_CYW43_BREADCRUMB_SUSPEND:
        return "suspend";
    case AP6256_CYW43_BREADCRUMB_SCAN_WAKE_ENTER:
        return "scan_wake_enter";
    case AP6256_CYW43_BREADCRUMB_SCAN_WAKE_EXIT:
        return "scan_wake_exit";
    case AP6256_CYW43_BREADCRUMB_SCAN_DRAIN_ENTER:
        return "scan_drain_enter";
    case AP6256_CYW43_BREADCRUMB_SCAN_DRAIN_EXIT:
        return "scan_drain_exit";
    case AP6256_CYW43_BREADCRUMB_ESCAN_IOVAR:
        return "escan_iovar";
    case AP6256_CYW43_BREADCRUMB_IOCTL_SEND:
        return "ioctl_send";
    case AP6256_CYW43_BREADCRUMB_IOCTL_WAIT:
        return "ioctl_wait";
    case AP6256_CYW43_BREADCRUMB_SDPCM_CREDIT_WAIT:
        return "sdpcm_credit_wait";
    case AP6256_CYW43_BREADCRUMB_SDPCM_TX:
        return "sdpcm_tx";
    case AP6256_CYW43_BREADCRUMB_CMD53_READ:
        return "cmd53_read";
    case AP6256_CYW43_BREADCRUMB_CMD53_WRITE:
        return "cmd53_write";
    case AP6256_CYW43_BREADCRUMB_CMD52:
        return "cmd52";
    case AP6256_CYW43_BREADCRUMB_SCAN_RETURN:
        return "scan_return";
    case AP6256_CYW43_BREADCRUMB_HARDFAULT:
        return "hardfault";
    case AP6256_CYW43_BREADCRUMB_MEMMANAGE:
        return "memmanage";
    case AP6256_CYW43_BREADCRUMB_BUSFAULT:
        return "busfault";
    case AP6256_CYW43_BREADCRUMB_USAGEFAULT:
        return "usagefault";
    case AP6256_CYW43_BREADCRUMB_STACK_OVERFLOW:
        return "stack_overflow";
    case AP6256_CYW43_BREADCRUMB_MALLOC_FAILED:
        return "malloc_failed";
    default:
        return "unknown";
    }
}

