CircuitSetup/stm32h7_test_program/src/ap6256_cyw43_port.c
void ap6256_cyw43_port_format_reset_flags(uint32_t flags, char *buffer, size_t buffer_len)
{
    if ((buffer == NULL) || (buffer_len == 0U)) {
        return;
    }

    buffer[0] = '\0';
    if ((flags & RCC_RSR_PORRSTF) != 0U) {
        ap6256_cyw43_append_reset_flag(buffer, buffer_len, "POR");
    }
    if ((flags & RCC_RSR_BORRSTF) != 0U) {
        ap6256_cyw43_append_reset_flag(buffer, buffer_len, "BOR");
    }
    if ((flags & RCC_RSR_PINRSTF) != 0U) {
        ap6256_cyw43_append_reset_flag(buffer, buffer_len, "PIN");
    }
    if ((flags & RCC_RSR_SFTRSTF) != 0U) {
        ap6256_cyw43_append_reset_flag(buffer, buffer_len, "SW");
    }
    if ((flags & RCC_RSR_IWDG1RSTF) != 0U) {
        ap6256_cyw43_append_reset_flag(buffer, buffer_len, "IWDG1");
    }
    if ((flags & RCC_RSR_WWDG1RSTF) != 0U) {
        ap6256_cyw43_append_reset_flag(buffer, buffer_len, "WWDG1");
    }
    if ((flags & RCC_RSR_LPWRRSTF) != 0U) {
        ap6256_cyw43_append_reset_flag(buffer, buffer_len, "LPWR");
    }
    if (buffer[0] == '\0') {
        (void)strncpy(buffer, "none", buffer_len - 1U);
        buffer[buffer_len - 1U] = '\0';
    }
}

void ap6256_cyw43_port_set_setup_status(int32_t status)
{
    s_cyw43_setup_status = status;
}

int32_t ap6256_cyw43_port_setup_status(void)
{
    return s_cyw43_setup_status;
}

static void ap6256_cyw43_port_record_cmd53(uint8_t write,
                                           uint8_t function,
                                           uint8_t block_mode,
                                           uint32_t block_size,
                                           uint32_t len,
                                           int32_t status,
                                           const uint8_t *buf)
{
    s_cyw43_last_cmd53_count++;
    s_cyw43_last_cmd53_write = write;
    s_cyw43_last_cmd53_function = function;
    s_cyw43_last_cmd53_block_mode = block_mode;
    s_cyw43_last_cmd53_block_size = block_size;
    s_cyw43_last_cmd53_length = len;
    s_cyw43_last_cmd53_status = status;
    s_cyw43_last_cmd53_frame_size = 0U;

    if ((write == 0U) && (status == 0) && (buf != NULL) && (len >= 2U)) {
        s_cyw43_last_cmd53_frame_size = (uint16_t)buf[0] | ((uint16_t)buf[1] << 8U);
    }
    ap6256_cyw43_port_persist_pre_reset_diag(0U);
}

static osMutexId_t ap6256_cyw43_mutex(void)
{
    static const osMutexAttr_t mutex_attr = {
        .name = "cyw43",
        .attr_bits = osMutexRecursive
    };

    if (s_cyw43_mutex != NULL) {
        return s_cyw43_mutex;
    }

    if ((osKernelGetState() == osKernelRunning) || (osKernelGetState() == osKernelReady)) {
        s_cyw43_mutex = osMutexNew(&mutex_attr);
    }

    return s_cyw43_mutex;
}

static void ap6256_cyw43_build_mac(uint8_t mac[6])
{
    uint32_t uid0 = HAL_GetUIDw0();
    uint32_t uid1 = HAL_GetUIDw1();
    uint32_t uid2 = HAL_GetUIDw2();

    mac[0] = 0x02U;
    mac[1] = (uint8_t)(uid0 & 0xFFU);
    mac[2] = (uint8_t)((uid0 >> 8U) & 0xFFU);
    mac[3] = (uint8_t)((uid0 >> 16U) & 0xFFU);
    mac[4] = (uint8_t)(uid1 & 0xFFU);
    mac[5] = (uint8_t)(uid2 & 0xFFU);
}

static int ap6256_cyw43_status_to_errno(ap6256_status_t st)
{
    switch (st) {
    case AP6256_STATUS_OK:
        return 0;
    case AP6256_STATUS_TIMEOUT:
        return -CYW43_ETIMEDOUT;
    case AP6256_STATUS_BAD_PARAM:
        return -CYW43_EINVAL;
    case AP6256_STATUS_IO_ERROR:
    case AP6256_STATUS_PROTOCOL_ERROR:
    default:
        return -CYW43_EIO;
    }
}

typedef enum {
    AP6256_CYW43_RESP_NONE = 0U,
    AP6256_CYW43_RESP_SHORT = 1U,
    AP6256_CYW43_RESP_LONG = 3U
} ap6256_cyw43_resp_t;

static ap6256_status_t ap6256_cyw43_send_cmd(uint32_t cmd_idx,
                                             uint32_t arg,
                                             ap6256_cyw43_resp_t waitresp,
                                             uint8_t ignore_crc_fail,
                                             uint32_t *response)
{
    uint32_t start = HAL_GetTick();
    uint32_t guard_loops = 0U;
    uint32_t status;
    uint32_t cmd = SDMMC_CMD_CPSMEN | (cmd_idx & 0x3FU);

    if (waitresp == AP6256_CYW43_RESP_SHORT) {
        cmd |= SDMMC_CMD_WAITRESP_0;
    } else if (waitresp == AP6256_CYW43_RESP_LONG) {
        cmd |= SDMMC_CMD_WAITRESP_0 | SDMMC_CMD_WAITRESP_1;
    }

    SDMMC1->ICR = 0xFFFFFFFFU;
    SDMMC1->ARG = arg;
    SDMMC1->CMD = cmd;

    while (1) {
        status = SDMMC1->STA;

        if (waitresp == AP6256_CYW43_RESP_NONE) {
            if ((status & SDMMC_STA_CMDSENT) != 0U) {
                break;
            }
        } else {
            if ((status & SDMMC_STA_CMDREND) != 0U) {
                break;
            }
            if ((status & SDMMC_STA_CCRCFAIL) != 0U) {
                if (ignore_crc_fail != 0U) {
                    break;
                }
                SDMMC1->ICR = 0xFFFFFFFFU;
                return AP6256_STATUS_PROTOCOL_ERROR;
            }
        }

        if ((status & SDMMC_STA_CTIMEOUT) != 0U) {
            SDMMC1->ICR = 0xFFFFFFFFU;
            return AP6256_STATUS_TIMEOUT;
        }

        if ((HAL_GetTick() - start) > AP6256_CYW43_SDIO_CMD_TIMEOUT_MS) {
            SDMMC1->ICR = 0xFFFFFFFFU;
            return AP6256_STATUS_TIMEOUT;
        }

        if (++guard_loops > AP6256_CYW43_SDIO_CMD_GUARD_LOOPS) {
            SDMMC1->ICR = 0xFFFFFFFFU;
            return AP6256_STATUS_TIMEOUT;
        }
    }

    if (response != NULL) {
        *response = SDMMC1->RESP1;
    }

    SDMMC1->ICR = 0xFFFFFFFFU;
    return AP6256_STATUS_OK;
}

void ap6256_cyw43_port_init(void)
{
    (void)ap6256_cyw43_mutex();
    s_cyw43_setup_status = 0;
}

void ap6256_cyw43_port_deinit(void)
{
    cyw43_poll = NULL;
    s_poll_pending = 0U;
    s_cyw43_sched_calls = 0U;
    s_cyw43_last_sched_func = 0U;
    s_cyw43_sdio_init_calls = 0U;
    s_cyw43_sdio_reinit_calls = 0U;
    s_cyw43_last_bus_init_ret = 0;
    s_cyw43_bus_stage = 0U;
    s_cyw43_poll_header_read_status = 0;
    s_cyw43_poll_payload_read_status = 0;
    s_cyw43_poll_hdr0 = 0U;
    s_cyw43_poll_hdr1 = 0U;
    s_cyw43_last_cmd53_write = 0U;
    s_cyw43_last_cmd53_function = 0U;
    s_cyw43_last_cmd53_block_mode = 0U;
    s_cyw43_last_cmd53_block_size = 0U;
    s_cyw43_last_cmd53_length = 0U;
    s_cyw43_last_cmd53_status = 0;
    s_cyw43_last_cmd53_frame_size = 0U;
    s_cyw43_last_cmd53_count = 0U;
    s_cyw43_last_cmd = 0U;
    s_cyw43_last_cmd_arg = 0U;
    s_cyw43_last_cmd_status = 0;
    s_cyw43_last_cmd_response = 0U;
    s_cyw43_chip_id_raw = 0U;
    s_cyw43_ram_base_addr = 0U;
    s_cyw43_ram_size_bytes = 0U;
    s_cyw43_boot_mode = AP6256_CYW43_BOOT_CM3_SOCRAM;
    s_cyw43_cpu_wrapper_addr = 0U;
    s_cyw43_ram_wrapper_addr = 0U;
    s_cyw43_firmware_addr = 0U;
    s_cyw43_nvram_addr = 0U;
    s_cyw43_footer_addr = 0U;
    s_cyw43_cpu_core_id = 0U;
    s_cyw43_ram_core_id = 0U;
    s_cyw43_reset_vector_addr = 0U;
    s_cyw43_reset_vector_value = 0U;
    s_cyw43_verify_mismatch_addr = 0U;
    s_cyw43_verify_expected = 0U;
    s_cyw43_verify_actual = 0U;
    s_cyw43_nvram_packed_len = 0U;
    s_cyw43_nvram_padded_len = 0U;
    s_cyw43_nvram_footer_word = 0U;
    s_cyw43_nvram_using_reference = 0U;
    s_cyw43_chip_clock_csr_diag = 0U;
    s_cyw43_sr_control1_diag = 0U;
    s_cyw43_wlan_ioctrl_diag = 0U;
    s_cyw43_wlan_resetctrl_diag = 0U;
    s_cyw43_socram_ioctrl_diag = 0U;
    s_cyw43_socram_resetctrl_diag = 0U;
    s_cyw43_wakeup_ctrl_diag = 0U;
    s_cyw43_sleep_csr_diag = 0U;
    s_cyw43_cardcap_diag = 0U;
    s_cyw43_io_ready_diag = 0U;
    s_cyw43_checkpoint = 0U;
    s_cyw43_checkpoint_result = AP6256_CYW43_CP_RESULT_PENDING;
    s_cyw43_last_success_checkpoint = 0U;
    s_cyw43_checkpoint_function = 0U;
    s_cyw43_checkpoint_address = 0U;
    s_cyw43_checkpoint_write_value = 0U;
    s_cyw43_checkpoint_readback_value = 0U;
    s_cyw43_checkpoint_status = 0;
    s_cyw43_profile = AP6256_CYW43_PROFILE_BASELINE;
    s_cyw43_backplane_is_write = 0U;
    s_cyw43_backplane_address = 0U;
    s_cyw43_backplane_width_bytes = 0U;
    s_cyw43_backplane_status = 0;
    s_cyw43_last_async_event_type = 0U;
    s_cyw43_last_async_event_status = 0U;
    s_cyw43_last_async_event_reason = 0U;
    s_cyw43_last_async_event_flags = 0U;
    s_cyw43_async_event_count = 0U;
    s_cyw43_last_ioctl_kind = 0U;
    s_cyw43_last_ioctl_cmd = 0U;
    s_cyw43_last_ioctl_iface = 0U;
    s_cyw43_last_ioctl_len = 0U;
    s_cyw43_last_ioctl_id = 0U;
    s_cyw43_last_ioctl_status = 0;
    s_cyw43_last_ioctl_poll = 0;
    s_cyw43_last_ioctl_phase = AP6256_CYW43_IOCTL_PHASE_NONE;
    s_cyw43_packet_pending = 0U;
    s_cyw43_packet_pending_source = AP6256_CYW43_PACKET_SRC_NONE;
    s_cyw43_dat1_level = 0U;
    s_cyw43_cccr_int_pending = 0U;
    s_cyw43_f1_int_status = 0U;
    s_cyw43_packet_pending_status = 0;
    s_cyw43_kso_status = 0;
    s_cyw43_scan_wake_step = AP6256_CYW43_SCAN_WAKE_NONE;
    s_cyw43_send_flow_control = 0U;
    s_cyw43_send_tx_seq = 0U;
    s_cyw43_send_credit = 0U;
    s_cyw43_send_synthetic_credit = 0U;
    s_cyw43_send_credit_status = 0;
}

void ap6256_cyw43_thread_enter(void)
{
    osMutexId_t mutex = ap6256_cyw43_mutex();

    if (mutex != NULL) {
        (void)osMutexAcquire(mutex, osWaitForever);
    }
}

void ap6256_cyw43_thread_exit(void)
{
    osMutexId_t mutex = ap6256_cyw43_mutex();

    if (mutex != NULL) {
        (void)osMutexRelease(mutex);
    }
}

void ap6256_cyw43_port_wait_step(void)
{
    osKernelState_t kernel_state = osKernelGetState();

