CircuitSetup/stm32h7_test_program/src/ap6256_cyw43_port.c
    if ((__get_PRIMASK() == 0U) &&
        ((kernel_state == osKernelRunning) || (kernel_state == osKernelReady))) {
        (void)osDelay(1U);
        return;
    }

    /*
     * If IRQs are masked or the scheduler is unavailable, avoid blocking on
     * osDelay() and do a short bounded spin so scan/ioctl loops can still
     * progress to their own timeout handling.
     */
    for (volatile uint32_t spin = 0U; spin < 12000U; ++spin) {
        __NOP();
    }
}

unsigned int cyw43_hal_ticks_us(void)
{
    return (unsigned int)(HAL_GetTick() * 1000U);
}

unsigned int cyw43_hal_ticks_ms(void)
{
    return (unsigned int)HAL_GetTick();
}

void cyw43_delay_us(unsigned int us)
{
    uint32_t start = HAL_GetTick() * 1000U;

    while (((HAL_GetTick() * 1000U) - start) < us) {
    }
}

void cyw43_delay_ms(unsigned int ms)
{
    osDelay(ms);
}

void cyw43_hal_get_mac(int interface, uint8_t mac[6])
{
    (void)interface;
    if (mac == NULL) {
        return;
    }
    ap6256_cyw43_build_mac(mac);
}

void cyw43_hal_pin_config(int pin, int mode, int pull, int alt)
{
    (void)pin;
    (void)mode;
    (void)pull;
    (void)alt;
}

void cyw43_hal_pin_config_irq_falling(int pin, int enable)
{
    /*
     * CYW43 uses WL_SDIO_1/DAT1 as its in-band interrupt source in SDIO mode.
     * On STM32H7, reconfiguring PC9 from SDMMC alternate-function into EXTI GPIO
     * steals DAT1 away from the 4-bit SDIO bus and can wedge subsequent transfers.
     *
     * Keep DAT1 owned by SDMMC1 at all times and treat interrupt enable/disable
     * as a logical no-op. The runtime already polls from a dedicated FreeRTOS task,
     * and cyw43_cb_read_host_interrupt_pin() can still sample the live DAT1 level.
     */
    (void)pin;
    (void)enable;
}

int cyw43_hal_pin_read(int pin)
{
    switch (pin) {
    case CYW43_PIN_WL_REG_ON:
        return (HAL_GPIO_ReadPin(AP6256_CYW43_WL_REG_ON_PORT, AP6256_CYW43_WL_REG_ON_PIN) == GPIO_PIN_SET) ? 1 : 0;
    case CYW43_PIN_WL_SDIO_1:
        return (HAL_GPIO_ReadPin(AP6256_CYW43_SDIO_DAT1_PORT, AP6256_CYW43_SDIO_DAT1_PIN) == GPIO_PIN_SET) ? 1 : 0;
    default:
        return 0;
    }
}

void cyw43_hal_pin_low(int pin)
{
    if (pin == CYW43_PIN_WL_REG_ON) {
        HAL_GPIO_WritePin(AP6256_CYW43_WL_REG_ON_PORT, AP6256_CYW43_WL_REG_ON_PIN, GPIO_PIN_RESET);
    }
}

void cyw43_hal_pin_high(int pin)
{
    if (pin == CYW43_PIN_WL_REG_ON) {
        HAL_GPIO_WritePin(AP6256_CYW43_WL_REG_ON_PORT, AP6256_CYW43_WL_REG_ON_PIN, GPIO_PIN_SET);
    }
}

void cyw43_schedule_internal_poll_dispatch(void (*func)(void))
{
    s_cyw43_sched_calls++;
    s_cyw43_last_sched_func = (uintptr_t)func;
    cyw43_poll = func;
    s_poll_pending = (func != NULL) ? 1U : 0U;
}

void ap6256_cyw43_port_poll(void)
{
    if (cyw43_poll == NULL) {
        return;
    }

    s_poll_pending = 0U;
    ap6256_cyw43_thread_enter();
    cyw43_poll();
    ap6256_cyw43_thread_exit();
}

uint8_t ap6256_cyw43_port_pending_poll(void)
{
    return s_poll_pending;
}

void cyw43_sdio_init(void)
{
    ap6256_status_t st;

    s_cyw43_sdio_init_calls++;
    st = ap6256_sdio_bus_prepare(1U, 0U);
    s_sdio_open = (st == AP6256_STATUS_OK) ? 1U : 0U;
}

void cyw43_sdio_reinit(void)
{
    s_cyw43_sdio_reinit_calls++;

    if (s_sdio_open == 0U) {
        cyw43_sdio_init();
    }
}

void cyw43_sdio_deinit(void)
{
    if (s_sdio_open != 0U) {
        ap6256_sdio_close();
        s_sdio_open = 0U;
    }
}

void cyw43_sdio_set_irq(bool enable)
{
    /*
     * See cyw43_hal_pin_config_irq_falling(): do not hand SDIO DAT1 to EXTI on
     * this board. Leave the pin mux on SDMMC1 and rely on the Wi-Fi poll task.
     */
    (void)enable;
}

void cyw43_sdio_enable_high_speed_4bit(void)
{
    /*
     * Keep the bus conservative during bring-up. The previous divider of 1 was
     * aggressive enough that short register traffic could work while the first
     * sustained firmware-download block transfer timed out.
     */
    MODIFY_REG(SDMMC1->CLKCR,
               SDMMC_CLKCR_WIDBUS | SDMMC_CLKCR_CLKDIV,
               SDMMC_CLKCR_WIDBUS_0 | 8U);
}

int cyw43_sdio_transfer(uint32_t cmd, uint32_t arg, uint32_t *resp)
{
    ap6256_status_t st;
    uint32_t local_resp = 0U;

    switch (cmd) {
    case 0U:
        st = ap6256_cyw43_send_cmd(0U, 0U, AP6256_CYW43_RESP_NONE, 1U, NULL);
        break;
    case 3U:
        st = ap6256_cyw43_send_cmd(3U, 0U, AP6256_CYW43_RESP_SHORT, 1U, &local_resp);
        break;
    case 5U:
        st = ap6256_cyw43_send_cmd(5U, arg, AP6256_CYW43_RESP_SHORT, 1U, &local_resp);
        break;
    case 7U:
        st = ap6256_cyw43_send_cmd(7U, arg, AP6256_CYW43_RESP_SHORT, 1U, NULL);
        if (st == AP6256_STATUS_OK) {
            ap6256_sdio_session_adopt((uint16_t)((arg >> 16U) & 0xFFFFU));
        }
        break;
    case 52U: {
        uint8_t value = 0U;
        uint8_t function = (uint8_t)((arg >> 28U) & 0x07U);
        uint32_t address = (arg >> 9U) & 0x1FFFFU;
        uint8_t write = ((arg & 0x80000000UL) != 0U) ? 1U : 0U;
        int32_t detail = (int32_t)(((uint32_t)function << 24U) |
                                   ((uint32_t)write << 23U) |
                                   (address & 0x1FFFFUL));

        ap6256_cyw43_port_record_breadcrumb(AP6256_CYW43_BREADCRUMB_CMD52, detail);
        if (write != 0U) {
            st = ap6256_sdio_cmd52_write_u8(function, address, (uint8_t)(arg & 0xFFU));
            if (st == AP6256_STATUS_OK) {
                local_resp = (arg & 0xFFU);
            }
        } else {
            st = ap6256_sdio_cmd52_read_u8(function, address, &value);
            if (st == AP6256_STATUS_OK) {
                local_resp = value;
            }
        }
        ap6256_cyw43_port_record_breadcrumb(AP6256_CYW43_BREADCRUMB_CMD52,
                                            ap6256_cyw43_status_to_errno(st));
        break;
    }
    default:
        st = AP6256_STATUS_BAD_PARAM;
        break;
    }

    if (resp != NULL) {
        *resp = local_resp;
    }

    ap6256_cyw43_port_record_last_cmd(cmd, arg, ap6256_cyw43_status_to_errno(st), local_resp);
    return ap6256_cyw43_status_to_errno(st);
}

int cyw43_sdio_transfer_cmd53(bool write, uint32_t block_size, uint32_t arg, size_t len, uint8_t *buf)
{
    ap6256_status_t st;
    int result;
    uint8_t function = (uint8_t)((arg >> 28U) & 0x07U);
    uint8_t block_mode = (uint8_t)((arg >> 27U) & 0x01U);
    uint8_t op_code = (uint8_t)((arg >> 26U) & 0x01U);
    uint32_t address = (arg >> 9U) & 0x1FFFFU;
    int32_t detail = (int32_t)(((uint32_t)function << 24U) |
                               ((uint32_t)(write ? 1U : 0U) << 23U) |
                               ((uint32_t)block_mode << 22U) |
                               ((uint32_t)len & 0x003FFFFFUL));

    ap6256_cyw43_port_record_breadcrumb(write ? AP6256_CYW43_BREADCRUMB_CMD53_WRITE
                                              : AP6256_CYW43_BREADCRUMB_CMD53_READ,
                                        detail);
    if (write) {
        st = ap6256_sdio_cmd53_write_ex(function, address, buf, (uint32_t)len, block_mode, op_code, block_size);
    } else {
        st = ap6256_sdio_cmd53_read_ex(function, address, buf, (uint32_t)len, block_mode, op_code, block_size);
    }

    result = ap6256_cyw43_status_to_errno(st);
    ap6256_cyw43_port_record_cmd53(write ? 1U : 0U,
                                   function,
                                   block_mode,
                                   block_size,
                                   (uint32_t)len,
                                   result,
                                   buf);
    ap6256_cyw43_port_record_breadcrumb(write ? AP6256_CYW43_BREADCRUMB_CMD53_WRITE
                                              : AP6256_CYW43_BREADCRUMB_CMD53_READ,
                                        result);
    return result;
}

void EXTI9_5_IRQHandler(void)
{
    if (__HAL_GPIO_EXTI_GET_IT(AP6256_CYW43_SDIO_DAT1_PIN) != RESET) {
        __HAL_GPIO_EXTI_CLEAR_IT(AP6256_CYW43_SDIO_DAT1_PIN);
        s_poll_pending = 1U;
    }
}

