CircuitSetup/stm32h7_test_program/src/ap6256_cyw43_port.c
uint32_t ap6256_cyw43_port_sched_calls(void)
{
    return s_cyw43_sched_calls;
}

uintptr_t ap6256_cyw43_port_last_sched_func(void)
{
    return s_cyw43_last_sched_func;
}

uint32_t ap6256_cyw43_port_sdio_init_calls(void)
{
    return s_cyw43_sdio_init_calls;
}

uint32_t ap6256_cyw43_port_sdio_reinit_calls(void)
{
    return s_cyw43_sdio_reinit_calls;
}

void ap6256_cyw43_port_record_last_cmd(uint32_t cmd, uint32_t arg, int32_t status, uint32_t response)
{
    s_cyw43_last_cmd = cmd;
    s_cyw43_last_cmd_arg = arg;
    s_cyw43_last_cmd_status = status;
    s_cyw43_last_cmd_response = response;
    ap6256_cyw43_port_persist_pre_reset_diag(0U);
}

uint32_t ap6256_cyw43_port_last_cmd(void)
{
    return s_cyw43_last_cmd;
}

uint32_t ap6256_cyw43_port_last_cmd_arg(void)
{
    return s_cyw43_last_cmd_arg;
}

int32_t ap6256_cyw43_port_last_cmd_status(void)
{
    return s_cyw43_last_cmd_status;
}

uint32_t ap6256_cyw43_port_last_cmd_response(void)
{
    return s_cyw43_last_cmd_response;
}

void ap6256_cyw43_port_set_chip_id_raw(uint32_t value)
{
    s_cyw43_chip_id_raw = value;
}

uint32_t ap6256_cyw43_port_chip_id_raw(void)
{
    return s_cyw43_chip_id_raw;
}

void ap6256_cyw43_port_set_ram_size_bytes(uint32_t value)
{
    s_cyw43_ram_size_bytes = value;
}

void ap6256_cyw43_port_set_ram_base_addr(uint32_t value)
{
    s_cyw43_ram_base_addr = value;
}

uint32_t ap6256_cyw43_port_ram_base_addr(void)
{
    return s_cyw43_ram_base_addr;
}

uint32_t ap6256_cyw43_port_ram_size_bytes(void)
{
    return s_cyw43_ram_size_bytes;
}

void ap6256_cyw43_port_set_boot_mode(uint32_t value)
{
    s_cyw43_boot_mode = value;
}

uint32_t ap6256_cyw43_port_boot_mode(void)
{
    return s_cyw43_boot_mode;
}

void ap6256_cyw43_port_set_boot_descriptor(uint32_t cpu_wrapper,
                                           uint32_t ram_wrapper,
                                           uint32_t firmware_addr,
                                           uint32_t nvram_addr,
                                           uint32_t footer_addr)
{
    s_cyw43_cpu_wrapper_addr = cpu_wrapper;
    s_cyw43_ram_wrapper_addr = ram_wrapper;
    s_cyw43_firmware_addr = firmware_addr;
    s_cyw43_nvram_addr = nvram_addr;
    s_cyw43_footer_addr = footer_addr;
}

void ap6256_cyw43_port_set_boot_topology(uint32_t cpu_core_id,
                                         uint32_t ram_core_id,
                                         uint32_t reset_vector_addr,
                                         uint32_t reset_vector_value)
{
    s_cyw43_cpu_core_id = cpu_core_id;
    s_cyw43_ram_core_id = ram_core_id;
    s_cyw43_reset_vector_addr = reset_vector_addr;
    s_cyw43_reset_vector_value = reset_vector_value;
}

uint32_t ap6256_cyw43_port_cpu_wrapper_addr(void)
{
    return s_cyw43_cpu_wrapper_addr;
}

uint32_t ap6256_cyw43_port_ram_wrapper_addr(void)
{
    return s_cyw43_ram_wrapper_addr;
}

uint32_t ap6256_cyw43_port_firmware_addr(void)
{
    return s_cyw43_firmware_addr;
}

uint32_t ap6256_cyw43_port_nvram_addr(void)
{
    return s_cyw43_nvram_addr;
}

uint32_t ap6256_cyw43_port_footer_addr(void)
{
    return s_cyw43_footer_addr;
}

uint32_t ap6256_cyw43_port_cpu_core_id(void)
{
    return s_cyw43_cpu_core_id;
}

uint32_t ap6256_cyw43_port_ram_core_id(void)
{
    return s_cyw43_ram_core_id;
}

uint32_t ap6256_cyw43_port_reset_vector_addr(void)
{
    return s_cyw43_reset_vector_addr;
}

uint32_t ap6256_cyw43_port_reset_vector_value(void)
{
    return s_cyw43_reset_vector_value;
}

void ap6256_cyw43_port_set_verify_mismatch(uint32_t address,
                                           uint32_t expected,
                                           uint32_t actual)
{
    s_cyw43_verify_mismatch_addr = address;
    s_cyw43_verify_expected = expected;
    s_cyw43_verify_actual = actual;
}

uint32_t ap6256_cyw43_port_verify_mismatch_addr(void)
{
    return s_cyw43_verify_mismatch_addr;
}

uint32_t ap6256_cyw43_port_verify_expected(void)
{
    return s_cyw43_verify_expected;
}

uint32_t ap6256_cyw43_port_verify_actual(void)
{
    return s_cyw43_verify_actual;
}

void ap6256_cyw43_port_set_nvram_metrics(uint32_t packed_len,
                                         uint32_t padded_len,
                                         uint32_t footer_word,
                                         uint8_t using_reference)
{
    s_cyw43_nvram_packed_len = packed_len;
    s_cyw43_nvram_padded_len = padded_len;
    s_cyw43_nvram_footer_word = footer_word;
    s_cyw43_nvram_using_reference = using_reference;
}

uint32_t ap6256_cyw43_port_nvram_packed_len(void)
{
    return s_cyw43_nvram_packed_len;
}

uint32_t ap6256_cyw43_port_nvram_padded_len(void)
{
    return s_cyw43_nvram_padded_len;
}

uint32_t ap6256_cyw43_port_nvram_footer_word(void)
{
    return s_cyw43_nvram_footer_word;
}

uint8_t ap6256_cyw43_port_nvram_using_reference(void)
{
    return s_cyw43_nvram_using_reference;
}

void ap6256_cyw43_port_set_core_diag(uint8_t chip_clock_csr,
                                     uint32_t sr_control1,
                                     uint32_t wlan_ioctrl,
                                     uint32_t wlan_resetctrl,
                                     uint32_t socram_ioctrl,
                                     uint32_t socram_resetctrl)
{
    s_cyw43_chip_clock_csr_diag = chip_clock_csr;
    s_cyw43_sr_control1_diag = sr_control1;
    s_cyw43_wlan_ioctrl_diag = wlan_ioctrl;
    s_cyw43_wlan_resetctrl_diag = wlan_resetctrl;
    s_cyw43_socram_ioctrl_diag = socram_ioctrl;
    s_cyw43_socram_resetctrl_diag = socram_resetctrl;
}

uint8_t ap6256_cyw43_port_chip_clock_csr_diag(void)
{
    return s_cyw43_chip_clock_csr_diag;
}

uint32_t ap6256_cyw43_port_sr_control1_diag(void)
{
    return s_cyw43_sr_control1_diag;
}

uint32_t ap6256_cyw43_port_wlan_ioctrl_diag(void)
{
    return s_cyw43_wlan_ioctrl_diag;
}

uint32_t ap6256_cyw43_port_wlan_resetctrl_diag(void)
{
    return s_cyw43_wlan_resetctrl_diag;
}

uint32_t ap6256_cyw43_port_socram_ioctrl_diag(void)
{
    return s_cyw43_socram_ioctrl_diag;
}

uint32_t ap6256_cyw43_port_socram_resetctrl_diag(void)
{
    return s_cyw43_socram_resetctrl_diag;
}

