CircuitSetup/stm32h7_test_program/src/ap6256_cyw43_port.c
void ap6256_cyw43_port_set_checkpoint(uint32_t checkpoint,
                                      uint32_t checkpoint_result,
                                      uint8_t function,
                                      uint32_t address,
                                      uint32_t write_value,
                                      uint32_t readback_value,
                                      int32_t status)
{
    s_cyw43_checkpoint = checkpoint;
    s_cyw43_checkpoint_result = checkpoint_result;
    if (checkpoint_result == AP6256_CYW43_CP_RESULT_OK) {
        s_cyw43_last_success_checkpoint = checkpoint;
    }
    s_cyw43_checkpoint_function = function;
    s_cyw43_checkpoint_address = address;
    s_cyw43_checkpoint_write_value = write_value;
    s_cyw43_checkpoint_readback_value = readback_value;
    s_cyw43_checkpoint_status = status;
}

uint32_t ap6256_cyw43_port_checkpoint(void)
{
    return s_cyw43_checkpoint;
}

uint32_t ap6256_cyw43_port_checkpoint_result(void)
{
    return s_cyw43_checkpoint_result;
}

uint32_t ap6256_cyw43_port_last_success_checkpoint(void)
{
    return s_cyw43_last_success_checkpoint;
}

uint8_t ap6256_cyw43_port_checkpoint_function(void)
{
    return s_cyw43_checkpoint_function;
}

uint32_t ap6256_cyw43_port_checkpoint_address(void)
{
    return s_cyw43_checkpoint_address;
}

uint32_t ap6256_cyw43_port_checkpoint_write_value(void)
{
    return s_cyw43_checkpoint_write_value;
}

uint32_t ap6256_cyw43_port_checkpoint_readback_value(void)
{
    return s_cyw43_checkpoint_readback_value;
}

int32_t ap6256_cyw43_port_checkpoint_status(void)
{
    return s_cyw43_checkpoint_status;
}

void ap6256_cyw43_port_set_profile(uint32_t profile)
{
    s_cyw43_profile = profile;
}

uint32_t ap6256_cyw43_port_profile(void)
{
    return s_cyw43_profile;
}

void ap6256_cyw43_port_set_stage5_snapshot(uint8_t wakeup_ctrl,
                                           uint8_t sleep_csr,
                                           uint8_t cardcap,
                                           uint8_t io_ready)
{
    s_cyw43_wakeup_ctrl_diag = wakeup_ctrl;
    s_cyw43_sleep_csr_diag = sleep_csr;
    s_cyw43_cardcap_diag = cardcap;
    s_cyw43_io_ready_diag = io_ready;
}

uint8_t ap6256_cyw43_port_wakeup_ctrl_diag(void)
{
    return s_cyw43_wakeup_ctrl_diag;
}

uint8_t ap6256_cyw43_port_sleep_csr_diag(void)
{
    return s_cyw43_sleep_csr_diag;
}

uint8_t ap6256_cyw43_port_cardcap_diag(void)
{
    return s_cyw43_cardcap_diag;
}

uint8_t ap6256_cyw43_port_io_ready_diag(void)
{
    return s_cyw43_io_ready_diag;
}

void ap6256_cyw43_port_record_backplane_access(uint8_t is_write,
                                               uint32_t address,
                                               uint8_t width_bytes,
                                               int32_t status)
{
    s_cyw43_backplane_is_write = is_write;
    s_cyw43_backplane_address = address;
    s_cyw43_backplane_width_bytes = width_bytes;
    s_cyw43_backplane_status = status;
}

uint8_t ap6256_cyw43_port_backplane_is_write(void)
{
    return s_cyw43_backplane_is_write;
}

uint32_t ap6256_cyw43_port_backplane_address(void)
{
    return s_cyw43_backplane_address;
}

uint8_t ap6256_cyw43_port_backplane_width_bytes(void)
{
    return s_cyw43_backplane_width_bytes;
}

int32_t ap6256_cyw43_port_backplane_status(void)
{
    return s_cyw43_backplane_status;
}

void ap6256_cyw43_port_record_async_event(uint32_t event_type,
                                          uint32_t status,
                                          uint32_t reason,
                                          uint32_t flags)
{
    s_cyw43_async_event_count++;
    s_cyw43_last_async_event_type = event_type;
    s_cyw43_last_async_event_status = status;
    s_cyw43_last_async_event_reason = reason;
    s_cyw43_last_async_event_flags = flags;
}

uint32_t ap6256_cyw43_port_last_async_event_type(void)
{
    return s_cyw43_last_async_event_type;
}

uint32_t ap6256_cyw43_port_last_async_event_status(void)
{
    return s_cyw43_last_async_event_status;
}

uint32_t ap6256_cyw43_port_last_async_event_reason(void)
{
    return s_cyw43_last_async_event_reason;
}

uint32_t ap6256_cyw43_port_last_async_event_flags(void)
{
    return s_cyw43_last_async_event_flags;
}

uint32_t ap6256_cyw43_port_async_event_count(void)
{
    return s_cyw43_async_event_count;
}

void ap6256_cyw43_port_record_ioctl(uint32_t kind,
                                    uint32_t cmd,
                                    uint32_t iface,
                                    uint32_t len,
                                    uint32_t id,
                                    int32_t status,
                                    int32_t last_poll)
{
    s_cyw43_last_ioctl_kind = kind;
    s_cyw43_last_ioctl_cmd = cmd;
    s_cyw43_last_ioctl_iface = iface;
    s_cyw43_last_ioctl_len = len;
    s_cyw43_last_ioctl_id = id;
    s_cyw43_last_ioctl_status = status;
    s_cyw43_last_ioctl_poll = last_poll;
    ap6256_cyw43_port_persist_pre_reset_diag(1U);
}

void ap6256_cyw43_port_set_ioctl_phase(uint32_t phase)
{
    s_cyw43_last_ioctl_phase = phase;
    ap6256_cyw43_port_persist_pre_reset_diag(0U);
}

uint32_t ap6256_cyw43_port_last_ioctl_kind(void)
{
    return s_cyw43_last_ioctl_kind;
}

uint32_t ap6256_cyw43_port_last_ioctl_cmd(void)
{
    return s_cyw43_last_ioctl_cmd;
}

uint32_t ap6256_cyw43_port_last_ioctl_iface(void)
{
    return s_cyw43_last_ioctl_iface;
}

uint32_t ap6256_cyw43_port_last_ioctl_len(void)
{
    return s_cyw43_last_ioctl_len;
}

uint32_t ap6256_cyw43_port_last_ioctl_id(void)
{
    return s_cyw43_last_ioctl_id;
}

int32_t ap6256_cyw43_port_last_ioctl_status(void)
{
    return s_cyw43_last_ioctl_status;
}

int32_t ap6256_cyw43_port_last_ioctl_poll(void)
{
    return s_cyw43_last_ioctl_poll;
}

uint32_t ap6256_cyw43_port_last_ioctl_phase(void)
{
    return s_cyw43_last_ioctl_phase;
}

void ap6256_cyw43_port_record_packet_pending(uint8_t packet_pending,
                                             uint8_t pending_source,
                                             uint8_t dat1_level,
                                             uint8_t cccr_int_pending,
                                             uint32_t f1_int_status,
                                             int32_t status)
{
    s_cyw43_packet_pending = (packet_pending != 0U) ? 1U : 0U;
    s_cyw43_packet_pending_source = pending_source;
    s_cyw43_dat1_level = dat1_level;
    s_cyw43_cccr_int_pending = cccr_int_pending;
    s_cyw43_f1_int_status = f1_int_status;
    s_cyw43_packet_pending_status = status;
    ap6256_cyw43_port_persist_pre_reset_diag(0U);
}

uint8_t ap6256_cyw43_port_packet_pending(void)
{
    return s_cyw43_packet_pending;
}

uint8_t ap6256_cyw43_port_packet_pending_source(void)
{
    return s_cyw43_packet_pending_source;
}

