CircuitSetup/stm32h7_test_program/src/ap6256_cyw43_port.c
uint8_t ap6256_cyw43_port_dat1_level(void)
{
    return s_cyw43_dat1_level;
}

uint8_t ap6256_cyw43_port_cccr_int_pending(void)
{
    return s_cyw43_cccr_int_pending;
}

uint32_t ap6256_cyw43_port_f1_int_status(void)
{
    return s_cyw43_f1_int_status;
}

int32_t ap6256_cyw43_port_packet_pending_status(void)
{
    return s_cyw43_packet_pending_status;
}

void ap6256_cyw43_port_set_kso_status(int32_t status)
{
    s_cyw43_kso_status = status;
    ap6256_cyw43_port_persist_pre_reset_diag(0U);
}

int32_t ap6256_cyw43_port_kso_status(void)
{
    return s_cyw43_kso_status;
}

void ap6256_cyw43_port_set_scan_wake_step(uint32_t step)
{
    s_cyw43_scan_wake_step = step;
}

uint32_t ap6256_cyw43_port_scan_wake_step(void)
{
    return s_cyw43_scan_wake_step;
}

void ap6256_cyw43_port_record_send_credit(uint8_t flow_control,
                                          uint8_t tx_seq,
                                          uint8_t credit,
                                          uint8_t synthetic_credit,
                                          int32_t status)
{
    s_cyw43_send_flow_control = flow_control;
    s_cyw43_send_tx_seq = tx_seq;
    s_cyw43_send_credit = credit;
    s_cyw43_send_synthetic_credit = synthetic_credit;
    s_cyw43_send_credit_status = status;
    ap6256_cyw43_port_persist_pre_reset_diag(0U);
}

uint8_t ap6256_cyw43_port_send_flow_control(void)
{
    return s_cyw43_send_flow_control;
}

uint8_t ap6256_cyw43_port_send_tx_seq(void)
{
    return s_cyw43_send_tx_seq;
}

uint8_t ap6256_cyw43_port_send_credit(void)
{
    return s_cyw43_send_credit;
}

uint8_t ap6256_cyw43_port_send_synthetic_credit(void)
{
    return s_cyw43_send_synthetic_credit;
}

int32_t ap6256_cyw43_port_send_credit_status(void)
{
    return s_cyw43_send_credit_status;
}

void ap6256_cyw43_port_note_wait_no_packet(void)
{
    s_cyw43_wait_no_packet_count++;
    ap6256_cyw43_port_persist_pre_reset_diag(0U);
}

void ap6256_cyw43_port_note_wait_recovery(void)
{
    s_cyw43_wait_recovery_count++;
    ap6256_cyw43_port_persist_pre_reset_diag(0U);
}

void ap6256_cyw43_port_note_wait_forced_probe(void)
{
    s_cyw43_wait_forced_probe_count++;
    ap6256_cyw43_port_persist_pre_reset_diag(0U);
}

void ap6256_cyw43_port_note_wait_resend(void)
{
    s_cyw43_wait_resend_count++;
    ap6256_cyw43_port_persist_pre_reset_diag(0U);
}

uint32_t ap6256_cyw43_port_wait_no_packet_count(void)
{
    return s_cyw43_wait_no_packet_count;
}

uint32_t ap6256_cyw43_port_wait_recovery_count(void)
{
    return s_cyw43_wait_recovery_count;
}

uint32_t ap6256_cyw43_port_wait_forced_probe_count(void)
{
    return s_cyw43_wait_forced_probe_count;
}

uint32_t ap6256_cyw43_port_wait_resend_count(void)
{
    return s_cyw43_wait_resend_count;
}

void ap6256_cyw43_port_set_ioctl_attempt_flags(uint8_t recovery_attempted,
                                               uint8_t forced_probe_attempted,
                                               uint8_t resend_attempted)
{
    s_cyw43_ioctl_recovery_attempted = (recovery_attempted != 0U) ? 1U : 0U;
    s_cyw43_ioctl_forced_probe_attempted = (forced_probe_attempted != 0U) ? 1U : 0U;
    s_cyw43_ioctl_resend_attempted = (resend_attempted != 0U) ? 1U : 0U;
    ap6256_cyw43_port_persist_pre_reset_diag(0U);
}

uint8_t ap6256_cyw43_port_ioctl_recovery_attempted(void)
{
    return s_cyw43_ioctl_recovery_attempted;
}

uint8_t ap6256_cyw43_port_ioctl_forced_probe_attempted(void)
{
    return s_cyw43_ioctl_forced_probe_attempted;
}

uint8_t ap6256_cyw43_port_ioctl_resend_attempted(void)
{
    return s_cyw43_ioctl_resend_attempted;
}

void ap6256_cyw43_port_get_pre_reset_diag(ap6256_cyw43_pre_reset_diag_t *diag)
{
    ap6256_cyw43_port_read_pre_reset_diag(diag);
}

uint8_t ap6256_cyw43_port_pre_reset_diag_valid(void)
{
    return ap6256_cyw43_pre_reset_valid_raw();
}

void ap6256_cyw43_port_set_reference_nvram_enabled(uint8_t enable)
{
    s_cyw43_reference_nvram_enabled = (enable != 0U) ? 1U : 0U;
}

uint8_t ap6256_cyw43_port_reference_nvram_enabled(void)
{
    return s_cyw43_reference_nvram_enabled;
}

void ap6256_cyw43_port_set_last_bus_init_ret(int32_t value)
{
    s_cyw43_last_bus_init_ret = value;
}

int32_t ap6256_cyw43_port_last_bus_init_ret(void)
{
    return s_cyw43_last_bus_init_ret;
}

void ap6256_cyw43_port_set_bus_stage(uint32_t value)
{
    s_cyw43_bus_stage = value;
}

uint32_t ap6256_cyw43_port_bus_stage(void)
{
    return s_cyw43_bus_stage;
}

void ap6256_cyw43_port_set_poll_diag(int32_t header_read_status,
                                     int32_t payload_read_status,
                                     uint16_t hdr0,
                                     uint16_t hdr1)
{
    s_cyw43_poll_header_read_status = header_read_status;
    s_cyw43_poll_payload_read_status = payload_read_status;
    s_cyw43_poll_hdr0 = hdr0;
    s_cyw43_poll_hdr1 = hdr1;
}

int32_t ap6256_cyw43_port_poll_header_read_status(void)
{
    return s_cyw43_poll_header_read_status;
}

int32_t ap6256_cyw43_port_poll_payload_read_status(void)
{
    return s_cyw43_poll_payload_read_status;
}

uint16_t ap6256_cyw43_port_poll_hdr0(void)
{
    return s_cyw43_poll_hdr0;
}

uint16_t ap6256_cyw43_port_poll_hdr1(void)
{
    return s_cyw43_poll_hdr1;
}

uint8_t ap6256_cyw43_port_last_cmd53_write(void)
{
    return s_cyw43_last_cmd53_write;
}

uint8_t ap6256_cyw43_port_last_cmd53_function(void)
{
    return s_cyw43_last_cmd53_function;
}

uint8_t ap6256_cyw43_port_last_cmd53_block_mode(void)
{
    return s_cyw43_last_cmd53_block_mode;
}

uint32_t ap6256_cyw43_port_last_cmd53_block_size(void)
{
    return s_cyw43_last_cmd53_block_size;
}

uint32_t ap6256_cyw43_port_last_cmd53_length(void)
{
    return s_cyw43_last_cmd53_length;
}

int32_t ap6256_cyw43_port_last_cmd53_status(void)
{
    return s_cyw43_last_cmd53_status;
}

uint16_t ap6256_cyw43_port_last_cmd53_frame_size(void)
{
    return s_cyw43_last_cmd53_frame_size;
}

uint32_t ap6256_cyw43_port_last_cmd53_count(void)
{
    return s_cyw43_last_cmd53_count;
}
